Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: In the Parameters section the acceleration, deceleration, velocity and target position can be set.
it_it: Nella sezione Parameters è possibile impostare accelerazione, decelerazione, velocità e posizione target.

source: In the Parameters section the homing method, homing speeds and homing acceleration can be set.
it_it: Nella sezione Parameters è possibile impostare il metodo di homing, le velocità di homing e l'accelerazione di homing.

source: In the Select Firmware section you can select the firmware file to be downloaded to the module.
it_it: Nella sezione Select Firmware è possibile selezionare il file del firmware da scaricare sul modulo.

source: In the Select Module section all connected modules are shown in a list.
it_it: Nella sezione Select Module vengono visualizzati tutti i moduli collegati in un elenco.

source: In the Assembler/Debugger Options dialog the following options can be set:
it_it: ella finestra di dialogo "Assembler/Debugger Options" è possibile impostare le seguenti opzioni:

source: In the center section of the register browser all register which are marked as active in the register list are shown.
it_it: Nella sezione centrale del browser dei registri vengono visualizzati tutti quelli contrassegnati come attivi nell'elenco dei registri.

source: In the first blank space, add the following
it_it: Nel primo spazio vuoto, aggiungere quanto segue

source: In the latter two cases the actual position in the program will be shown in the editor by a green arrow on the left side and the program execution can be continued by using the Run/Continue function, the Step function or the Animate function.
it_it: In questi ultimi due casi, la posizione effettiva nel programma verrà visualizzata nell'editor da una freccia verde sul lato sinistro e l'esecuzione del programma potrà essere proseguita utilizzando la funzione Run/Continue, la funzione Step o la funzione Animate.

source: In the left input field, data can be entered as a decimal value only, whereas in the right input field either hexadecimal or decimal numbers can be entered.
it_it: Nel campo di input a sinistra, i dati possono essere inseriti solo come valore decimale, mentre nel campo di input a destra è possibile inserire numeri esadecimali o decimali.

source: In the pop-up menu, select the path to save the project, and enter a project name, such as Hello_World, click Save
it_it: Nel menu pop-up, selezionare il path in cui salvare il progetto e inserire un nome per il progetto, ad esempio Hello_World, cliccare su Save

source: In the right corner you can get by clicking the icon to open a list of all modules, You can choose any existing module to the related tools
it_it: Nell'angolo destro, cliccando sull'icona , si può aprire un elenco di tutti i moduli. Si può scegliere qualsiasi modulo esistente dagli strumenti correlati.

source: In the submenu, enter the new node ID and press the return key.
it_it: Nel sottomenù, inserire il nuovo ID nodo e premere il tasto Invio.

source: In the submenu, just enter its node ID and press the return key.
it_it: Nel sottomenù, è sufficiente inserire il relativo ID nodo e premere il tasto Invio.

source: In the this case click the Readout button to update the flags view.
it_it: In questo caso, cliccare sul pulsante Readout per aggiornare la vista flag.

source: In the upper area of the RPDO tab, all RPDOs supported by the device are shown.
it_it: Nella parte superiore della scheda RPDO vengono visualizzati tutti gli RPDO supportati dal dispositivo.

source: In the upper area of the TPDO tab, all TPDOs supported by the device are shown.
it_it: Nell'area superiore della scheda TPDO vengono visualizzati tutti i TPDO supportati dal dispositivo.

source: In the wizard tool you can pick a module to have a collection of available wizards.
it_it: Nello strumento Wizard è possibile selezionare un modulo per avere una raccolta di Wizard disponibili.

source: In this case the firmware update will not be possible.
it_it: In questo caso, l'aggiornamento del firmware non sarà possibile.

source: In this case the program cannot be continued, but it can be started again from the beginning using the Run function, the Single Step function or the Animate function.
it_it: In questo caso il programma non può continuare, ma può essere riavviato dall'inizio utilizzando la funzione Run, la funzione Single Step o la funzione Animate.

source: In this case, the TF-Luna (external device) may not be configured to I2C mode.
it_it: In questo caso, il TF-Luna (dispositivo esterno) potrebbe non essere configurato in modalità I2C.

source: In this case, users can only manually install these libraries offline.
it_it: In questo caso, gli utenti possono installare manualmente queste librerie solo offline.

source: In this chapter we assume that the reader is already familiar with TMCL, and only the differences between TMCL/PC and TMCL are pointed out.
it_it: In questo capitolo si presuppone che il lettore abbia già familiarità con TMCL e vengono evidenziate solo le differenze tra TMCL/PC e TMCL.

source: In this menu, hexadecimal or decimal value representation can also be selected and the PDO entry can be added to the graphical view.
it_it: In questo menù è possibile selezionare anche la rappresentazione decimale o esadecimale e aggiungere la voce PDO alla vista grafica.

source: Inactive RPDOs are shown in gray color and cannot be selected.
it_it: Gli RPDO inattivi vengono visualizzati in grigio e non possono essere selezionati.

source: Inactive TPDOs are displayed in gray color.
it_it: I TPDO inattivi sono visualizzati in grigio.

source: Include file path: The path used to search for include files included by the #include directive.
it_it: Include file path: Percorso utilizzato per cercare i file inclusi dalla direttiva #include.

source: Index: The index of the object as a hexadecimal value.
it_it: Index: L'indice dell'oggetto in esadecimale.

source: Industrial USB to UART/I2C/SPI/JTAG Converter
it_it: Convertitore da USB Industriale a UART/I2C/SPI/JTAG

source: Information given in this document is believed to be accurate and reliable.
it_it: Le informazioni fornite in questo documento sono ritenute accurate e affidabili.

source: Inhibit time: the inhibit time of the selected TPDO (given in 1/10ms).
it_it: Inhibit time: il tempo di inibizione del TPDO selezionato (espresso in 1/10 ms).

source: Initialization effect as shown below: (the screen is not on).
it_it: Effetto dell'inizializzazione come mostrato di seguito: (lo schermo non è acceso).

source: Initialize SPI parameters according to the use of the environment, after selecting the parameters click on the initialization of SPI (more clicks on the initialization of SPI, to prevent initialization failure).
it_it: Inizializzare i parametri SPI in base all'ambiente di utilizzo; dopo aver selezionato i parametri, cliccare sull'inizializzazione SPI (cliccare più volte sull'inizializzazione SPI per evitare errori di inizializzazione).

source: Initialize serial communication at a baud rate of 115200.
it_it: Inizializza la comunicazione seriale a una velocità di 115200 baud.

source: Initialize the Waveshare ESP32-S3 RGB LCD, and then you can choose to turn the screen backlight on or off.
it_it: Inizializza il display LCD RGB Waveshare ESP32-S3, quindi si puà scegliere se accendere o spegnere la retroilluminazione dello schermo.

source: Input 20 5A 05 07 01 67, clicking Write/Read will turn on the TF-Luna's data output (the TF-Luna's red light is on again).
it_it: Immettere 20 5A 05 07 01 67, cliccando su "Write/Read" si attiverà l'uscita dati del TF-Luna (la luce rossa del TF-Luna si riaccenderà).

source: Input the data to be sent in the I2C input box (the input is hexadecimal data), and click Write/Read.
it_it: Inserire i dati da inviare nella casella di input I2C (l'input è in esadecimale) e cliccare su "Write/Read".

source: Insert the TF card into the board
it_it: Inserire la scheda TF nella board

source: Install MAC Driver and flash again.
it_it: Installare il MAC Driver e flashare nuovamente.

source: Install Arduino-ESP32
it_it: Installazione di Arduino-ESP32

source: Install Arduino-ESP32 board
it_it: Installazione della scheda Arduino-ESP32

source: Install Espressif IDF Plugin
it_it: Installazione del Plugin Espressif IDF

source: Install Libraries
it_it: Installazione delle Librerie

source: Install Offline
it_it: Installazione Offline

source: Install Python IDLE (Installation address: Python IDLE), please select and add to PATH when installing.
it_it: Installare Python IDLE (indirizzo di installazione: Python IDLE), selezionare "add to PATH" durante l'installazione.

source: Install development board
it_it: Installare la board di sviluppo

source: Install on Ubuntu with different commands:
it_it: Installare su Ubuntu con diversi comandi:

source: Install serial library: (If you fail, you can execute sudo pip3 install pyserial)
it_it: Installare la libreria seriale: (Se non si riesce, si può eseguire sudo pip3 install pyserial)

source: Install the execution environment on Raspberry Pi:
it_it: Installare l'ambiente di esecuzione su Raspberry Pi:

source: Installing the TMCL-IDE
it_it: Installazione di TMCL-IDE

source: Instead of TMCL parameters, CANopen objects can be selected to be displayed in the graph.
it_it: Invece dei parametri TMCL, è possibile selezionare oggetti CANopen da visualizzare nel grafico.

source: Instead of TMCL parameters, CANopen objects can be selected to be displayed.
it_it: Invece dei parametri TMCL, è possibile selezionare oggetti CANopen da visualizzare.

source: Instructions for use are also printed to instruct the user on how to use these commands.
it_it: Vengono inoltre stampate istruzioni per l'uso che spiegano all'utente come utilizzare questi comandi.

source: Integer (Round)
it_it: Intero (Arrotonda)

source: Integer (truncate)
it_it: Intero (tronca)

source: Integrating EDS Files into the TMCL-IDE
it_it: Integrazione dei file EDS in TMCL-IDE

source: Intelligent PDO download: When this option is selected, PDO definition objects contained by the DCF file will be downloaded in such a way that PDO definitions will work correctly.
it_it: Intelligent PDO download: Quando questa opzione è selezionata, gli oggetti di definizione PDO contenuti nel file DCF verranno scaricati in modo tale che le definizioni PDO funzionino correttamente.

source: Interface Description
it_it: Descrizione dell'Interfaccia

source: Interface Form
it_it: Formato dell'Interfaccia

source: Interface Protection
it_it: Protezione Interfaccia

source: Interfaces using the SLCAN protocol that use either USB VID AD50h / PID 60C4h (e.g. CANable firmware) or USB VID 2A3Ch / PID 0801h (e.g. Trinamic interfaces with SLCAN firmware).
it_it: Interfacce che utilizzano il protocollo SLCAN che utilizzano USB VID AD50h / PID 60C4h (ad es. firmware CANable) o USB VID 2A3Ch / PID 0801h (ad es. interfacce Trinamic con firmware SLCAN).

source: Internally, the assembler uses floating point arithmetic to evaluate a constant expression, but as TMCL commands only take integer values, the result of a constant expression will always be rounded to an integer value when being used as an argument to a TMCL command.
it_it: Internamente, l'assembler utilizza l'aritmetica in virgola mobile per valutare un'espressione costante, ma poiché i comandi TMCL accettano solo valori interi, il risultato di un'espressione costante verrà sempre arrotondato a un valore intero quando viene utilizzato come argomento di un comando TMCL.

source: Interpreting the Result
it_it: Interpretazione del Risultato

source: Introduction
it_it: Introduzione

source: It aims to help users master the development board and facilitate secondary development.
it_it: L'obiettivo è aiutare gli utenti a padroneggiare la scheda di sviluppo e facilitare lo sviluppo secondario.

source: It allows directly sending an SPI datagram to the connected chip.
it_it: Permette di inviare direttamente un datagramma SPI al chip connesso.

source: It also can be used to control evaluation boards (which do not support stand-alone TMCL programming) programmatically from the PC (which is sometimes needed for testing).
it_it: Può anche essere utilizzato per controllare le evaluation board (che non supportano la programmazione TMCL stand-alone) a livello di programmazione dal PC (a volte necessario per i test).

source: It also offers the possibility to add devices to the list that are already configured, so that their node ID and bitrate settings can also be changed.
it_it: Offre inoltre la possibilità di aggiungere all'elenco dispositivi già configurati, in modo da poterne modificare anche l'ID nodo e le impostazioni di bitrate.

source: It can also be reset by clicking Stop & Reset so that it can be restarted from the beginning again.
it_it: È anche possibile reimpostarlo cliccando su Stop & Reset in modo da poterlo riavviare dall'inizio.

source: It can be aborted by clicking the Abort button.
it_it: Può essere interrotto cliccando sul pulsante Abort.

source: It can be continued by clicking Run, Animate or Step again.
it_it: È possibile continuare cliccando nuovamente su Run, Animate o Step.

source: It can be used for example to help debugging a TMCL program.
it_it: È utilizzabile, ad esempio, per facilitare il debug di un programma TMCL.

source: It can then be continued by using the Run/Continue function, the Animate function or the Single Step function.
it_it: quindi possibile riprenderla utilizzando la funzione Run/Continue, la funzione Animate o la funzione Single Step.

source: It combines a variety of peripheral interfaces (e.g., CAN, I2C, RS485, etc.) to quickly develop applications such as HMIs for ESP32-S3.
it_it: Combina una varietà di interfacce periferiche (ad esempio CAN, I2C, RS485, ecc.) per sviluppare rapidamente applicazioni come HMI per ESP32-S3.

source: It contains a set of tools for easily setting parameters, for visualizing measured data and for developing and debugging stand-alone applications with TMCL™, the Trinamic Motion Control Language.
it_it: Contiene una serie di strumenti per impostare facilmente i parametri, visualizzare i dati misurati e sviluppare e debuggare applicazioni stand-alone con TMCL™, il "Trinamic Motion Control Language".

source: It does not stop the motors.
it_it: Non arresta i motori.

source: It helps to find the necessary motor parameter adjustments when StallGuard2 and CoolStep are to be used.
it_it: Aiuta a individuare le necessarie regolazioni dei parametri del motore quando si utilizzano StallGuard2 e CoolStep.

source: It is a non-modal window that can be used together with the TMCL/PC main window.
it_it: Si tratta di una finestra non modale utilizzabile insieme alla finestra principale di TMCL/PC.

source: It is also possible to limit the motion between two positions.
it_it: È anche possibile limitare il movimento tra due posizioni.

source: It is also possible to make changes here after a DCF file has been loaded.
it_it: È anche possibile apportare modifiche qui dopo il caricamento di un file DCF.

source: It is also possible to perform manual tuning of velocity with the tool.
it_it: È anche possibile eseguire la regolazione manuale della velocità col tool.

source: It is also possible to perform manual tuning with the tool.
it_it: È anche possibile eseguire la regolazione manuale col tool.

source: It is also possible to perform the tuning in manual mode as well by following the same steps described in the auto mode.
it_it: È anche possibile eseguire la regolazione in modalità manuale seguendo gli stessi passaggi descritti nella modalità automatica.

source: It is also possible to select PDO entries to be displayed in a graphical way.
it_it: È anche possibile selezionare le voci PDO da visualizzare graficamente.

source: It is also possible to write out the same value again just by pressing the Return key or the Enter key once again.
it_it: È anche possibile riscrivere lo stesso valore semplicemente premendo nuovamente il tasto Return o Enter.

source: It is capable of converting from internal units to physical units as well as from physical units to internal units.
it_it: È in grado di convertire da unità interne a unità fisiche e viceversa.

source: It is developed using the C language, including a compiler, debugger, and flashing tool, etc., and can be developed via the command lines or through an integrated development environment (such as Visual Studio Code with the Espressif IDF plugin).
it_it: È sviluppato in linguaggio C, includendo un compilatore, un debugger, uno strumento di flashing, ecc. e può essere sviluppato tramite riga di comando o tramite un ambiente di sviluppo integrato (come Visual Studio Code con il plugin Espressif IDF).

source: It is for mounting the IO expansion chip, touch interface, I2C external interface
it_it: È destinato al montaggio del chip di espansione IO, dell'interfaccia touch e dell'interfaccia esterna I2C.

source: It is generally recommended to use Install Online.
it_it: In genere, si consiglia di utilizzare l'Installazione online.

source: It is grouped into three sections:
it_it: È suddivisa in tre parti:

source: It is not possible to change the P and I parameters in the auto mode but is possible in the manual mode.
it_it: Non è possibile modificare i parametri P e I in modalità automatica, ma è possibile farlo in modalità manuale.

source: It is possible to download a version with automated installation.
it_it: È possibile scaricare una versione con installazione automatica.

source: It is possible to perform tuning in both manual and auto mode however using auto mode is preferred.
it_it: È possibile eseguire l'ottimizzazione sia in modalità manuale che automatica, tuttavia è preferibile utilizzare la modalità automatica.

source: It is pre-configured for displaying the actual velocity and the target velocity, but it can be used for graphically monitoring also anything else.
it_it: È preconfigurato per visualizzare la velocità effettiva e quella target, ma può essere utilizzato anche per monitorare graficamente qualsiasi altra cosa.

source: It is provided for BLDC motor modules only.
it_it: È disponibile solo per i moduli motore BLDC.

source: It is provided once for each axis of the connected module.
it_it: Viene fornito una volta per ciascun asse del modulo collegato.

source: It is strongly recommended to use this command only for registers of up to 32 bits width.
it_it: Si consiglia vivamente di utilizzare questo comando solo per registri con larghezza fino a 32 bit.

source: It is then automatically recognized by the TMCL-IDE.
it_it: Viene quindi riconosciuto automaticamente da TMCL-IDE.

source: It is to be noted that there is no units for position because normally its units are in steps and that is dependent on the resolution of the position sensor connected.
it_it: È importante notare che non ci sono unità di misura per la posizione, poiché normalmente le sue unità sono a passi e ciò dipende dalla risoluzione del sensore di posizione collegato.

source: It is unlikely that exactly the same result is produced when recording a profile with the same parameters again.
it_it: È improbabile che si ottenga esattamente lo stesso risultato registrando nuovamente un profilo con gli stessi parametri.

source: It may take a long time to compile especially for the first time
it_it: La compilazione potrebbe richiedere molto tempo, soprattutto la prima volta.

source: It reads out all axis parameters and generates a TMCL program file that contains SAP commands for all these parameters.
it_it: Legge tutti i parametri degli assi e genera un file di programma TMCL contenente i comandi SAP per tutti questi parametri.

source: It scans through given velocities and shows which velocities are the best ones to be used with StallGuard.
it_it: Esamina le velocità fornite e mostra quali sono le velocità migliori da utilizzare con StallGuard.

source: It supports 2.4GHz WiFi and BLE 5, integrates high-capacity Flash and PSRAM, and has a 4.3-inch wide capacitive touch LCD screen on board to smoothly run GUI interface programs such as LVGL.
it_it: Supporta WiFi a 2,4 GHz e BLE 5, integra Flash e PSRAM ad alta capacità e dispone di un ampio display LCD touch capacitivo da 4,3 pollici per eseguire senza problemi programmi con interfaccia grafica come LVGL.

source: It then takes the current time (in milliseconds) and checks if it's time to send the message.
it_it: Poi, rileva l'ora corrente (in millisecondi) e verifica se è il momento di inviare il messaggio.

source: It will be shown as module in bootloader mode in the tree view then.
it_it: Verrà quindi visualizzato come modulo in modalità bootloader nella vista ad albero.

source: It will then appear in the list.
it_it: Il dispositivo verrà quindi visualizzato nell'elenco.

source: It will then be removed from the list of mapped objects.
it_it: Verrà quindi rimosso dall'elenco degli oggetti mappati.

source: It works exactly the same way as the Velocity Graph (please see there), with the only exception that it is pre-configured for showing the actual position and the target position.
it_it: Funziona esattamente come il Velocity Graph ((vedere lì)), con l'unica eccezione che è preconfigurato per mostrare la posizione effettiva e quella target.

source: It works exactly the same way as the Velocity Graph (please see there), with the only exception that it is pre-configured for showing the actual torque and the target torque.
it_it: Funziona esattamente come il Velocity Graph (vedere lì), con l'unica eccezione che è preconfigurato per mostrare la coppia effettiva e quella target.

source: It's normal for the first compilation to be slow, just be patient
it_it: È normale che la prima compilazione sia lenta, basta avere pazienza.

source: Its background color will then become white again.
it_it: Il colore di background tornerà quindi bianco.

source: Its window is divided into three sections:
it_it: La sua finestra è divisa in tre sezioni:

source: JTAG Interface Usage
it_it: Utilizzo dell'Interfaccia JTAG

source: Just change the value that you would like to convert and see how all other parameters that depend on this value are automatically re-calculated then.
it_it: Basta modificare il valore che si desidera convertire e vedere come tutti gli altri parametri che dipendono da questo valore vengono ricalcolati automaticamente.

source: Just change the value that you would like to convert and see how the other values get changed then.
it_it: È sufficiente modificare il valore che si desidera convertire e osservare come cambiano gli altri valori.

source: Just like with torque/flux tuning, velocity tuning can be done both in auto and manual mode.
it_it: Proprio come per la regolazione di "torque/flux" [coppia/flusso], la regolazione della velocità può essere eseguita sia in modalità automatica che manuale.

source: KG assumes no liability for any patent and/or other trademark rights of a third party resulting from processing or handling of the product and/or any other use of the product.
it_it: KG non si assume alcuna responsabilità per eventuali brevetti e/o altri diritti di marchio di terze parti derivanti dall'elaborazione o dalla manipolazione del prodotto e/o da qualsiasi altro utilizzo del prodotto.

source: KG conveys no patent, copyright, mask work right or other trademark right to this product.
it_it: KG non trasferisce alcun brevetto, copyright, diritto di mascheramento o altro diritto di marchio su questo prodotto.
